## Sql

## Connect to mysql Server

In [30]:
import mysql.connector

## connet to the server
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="12805shaker"
)

print(mydb) 

### connet to cursor
cursor = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000024E4CAE4B50>

In [18]:
## Delet database
cursor.execute("DROP DATABASE ch2")

In [19]:
## Create a database
cursor.execute("CREATE DATABASE IF NOT EXISTS ch2")
cursor.execute("SHOW DATABASES")
for x in cursor:
    print(x)

('bank',)
('ch2',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

In [20]:
## Use a database
cursor.execute("USE ch2")

# Chapter-2: Creating and Populating a Database

In [5]:
# ## Create a table

cursor.execute("""
  CREATE TABLE IF NOT EXISTS person(
    person_id SMALLINT UNSIGNED,
    fname VARCHAR(20),
    lname VARCHAR(20),
    gender ENUM("M", "F"), ## make sure that value is form this two
    birth_date DATE,
    street VARCHAR(30),
    city VARCHAR(20),
    state VARCHAR(20),
    country VARCHAR(20),
    postal_code VARCHAR(20),
    CONSTRAINT pk_person PRIMARY KEY (person_id)          
    )
""")


# ## Change the persn id to auto increment
cursor.execute("ALTER TABLE person MODIFY person_id SMALLINT UNSIGNED AUTO_INCREMENT")

cursor.execute("""
  CREATE TABLE IF NOT EXISTS food(
    person_id SMALLINT UNSIGNED,
    food VARCHAR(20),  
    CONSTRAINT pk_food PRIMARY KEY (person_id, food),
    CONSTRAINT fk_food FOREIGN KEY (person_id) 
      REFERENCES person (person_id)  
    )
""")
## Check table
cursor.execute("DESC person")

for table in cursor:
    print(table)

('person_id', b'smallint unsigned', 'NO', 'PRI', None, 'auto_increment')
('fname', b'varchar(20)', 'YES', '', None, '')
('lname', b'varchar(20)', 'YES', '', None, '')
('gender', b"enum('M','F')", 'YES', '', None, '')
('birth_date', b'date', 'YES', '', None, '')
('street', b'varchar(30)', 'YES', '', None, '')
('city', b'varchar(20)', 'YES', '', None, '')
('state', b'varchar(20)', 'YES', '', None, '')
('country', b'varchar(20)', 'YES', '', None, '')
('postal_code', b'varchar(20)', 'YES', '', None, '')

In [6]:
## Insert data
cursor.execute("""
  INSERT INTO person (person_id, fname, lname, gender, birth_date)
  VALUES (null, "William", "Turner", "M", "1972-05-27")
""")

cursor.execute("""
  INSERT INTO food (person_id, food)
  VALUES (1, "pizza")
""")
cursor.execute("""
  INSERT INTO food (person_id, food)
  VALUES (1, "nachos")
""")
cursor.execute("""
  INSERT INTO food (person_id, food)
  VALUES (1, "cookies")
""")

In [7]:
# Select form table with where
cursor.execute("""SELECT person_id, fname, lname, birth_date 
                  FROM person 
                  WHERE person_id = 1
              """)

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'William', 'Turner', datetime.date(1972, 5, 27))

In [8]:
# select with where and order
cursor.execute("""SELECT food 
                  FROM food
                  WHERE person_id = 1
                  ORDER BY food
                  """)    
rows = cursor.fetchall()
for row in rows:
    print(row)

('cookies',)
('nachos',)
('pizza',)

In [13]:
#Upadet Data
cursor.execute("""
    UPDATE person
    SET street = "1225 Tremont St",
        city = "Boston",
        state = "MA",
        country = "USA",
        postal_code = "02138"
    WHERE person_id = 1
""")
cursor.execute("""SELECT * FROM person""")

  
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'William', 'Turner', 'M', datetime.date(1980, 12, 21), '1225 Tremont St', 'Boston', 'MA', 'USA', '02138')

In [16]:
### Update date by specifying the format
cursor.execute("""
    UPDATE person
    SET birth_date = str_to_date("DEC-21-1980", "%b-%d-%Y")
    WHERE person_id = 1

""")

cursor.execute("""SELECT * FROM person""")

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'William', 'Turner', 'M', datetime.date(1980, 12, 21), '1225 Tremont St', 'Boston', 'MA', 'USA', '02138')

In [17]:
# Delete row
cursor.execute("""
    DELETE FROM food
    WHERE food = "pizza"
""")
cursor.execute("""SELECT * FROM food""")

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'cookies')
(1, 'nachos')

In [18]:
# Delete table
cursor.execute("""
    DROP TABLE food
    """)

cursor.execute("""
    DROP TABLE person
    """)

In [6]:
## Create a database
cursor.execute("SHOW TABLES")
for x in cursor:
    print(x)

# Chapter-3: Querry Primer

# querry clauses:

- SELECT
- FROM
- WHERE
- GROUP BY
- HAVING
- ORDERED BY

In [97]:
import mysql.connector

## connet to the server
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="12805shaker"
)

print(mydb) 

### connet to cursor
cursor = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000024E4CC48BD0>

In [98]:
cursor.execute("USE bank")
cursor.execute("SHOW TABLES")
for x in cursor:
    print(x)

('account',)
('branch',)
('business',)
('customer',)
('department',)
('employee',)
('employee_vw',)
('individual',)
('officer',)
('product',)
('product_type',)
('transaction',)

# Select

- it's last clause evaluated

- It could include numbers, strings, expressions, build-in functions, user defined functions

In [80]:
cursor.execute(""" 
    SELECT emp_id,
        "ACTIVE",
        emp_id * 3.14,
        UPPER(lname)
        FROM employee            
""")
for x in cursor:
    print(x)

(1, 'ACTIVE', Decimal('3.14'), 'SMITH')
(2, 'ACTIVE', Decimal('6.28'), 'BARKER')
(3, 'ACTIVE', Decimal('9.42'), 'TYLER')
(4, 'ACTIVE', Decimal('12.56'), 'HAWTHORNE')
(5, 'ACTIVE', Decimal('15.70'), 'GOODING')
(6, 'ACTIVE', Decimal('18.84'), 'FLEMING')
(7, 'ACTIVE', Decimal('21.98'), 'TUCKER')
(8, 'ACTIVE', Decimal('25.12'), 'PARKER')
(9, 'ACTIVE', Decimal('28.26'), 'GROSSMAN')
(10, 'ACTIVE', Decimal('31.40'), 'ROBERTS')
(11, 'ACTIVE', Decimal('34.54'), 'ZIEGLER')
(12, 'ACTIVE', Decimal('37.68'), 'JAMESON')
(13, 'ACTIVE', Decimal('40.82'), 'BLAKE')
(14, 'ACTIVE', Decimal('43.96'), 'MASON')
(15, 'ACTIVE', Decimal('47.10'), 'PORTMAN')
(16, 'ACTIVE', Decimal('50.24'), 'MARKHAM')
(17, 'ACTIVE', Decimal('53.38'), 'FOWLER')
(18, 'ACTIVE', Decimal('56.52'), 'TULMAN')

- if select only include build in function or evaluate simple expression, we can skip FROM

In [81]:
cursor.execute(""" 
    SELECT VERSION(),
    USER(),
    DATABASE()
""")
for x in cursor:
    print(x)

('8.0.32', 'root@localhost', 'bank')

- Rename columns using aliases(with or without AS)

In [82]:
cursor.execute(""" 
    SELECT emp_id,
        "ACTIVE" status,
        emp_id * 3.14 empid_x_pi,
        UPPER(lname) last_name_upper
        FROM employee            
""")
columns = cursor.description
print(columns)

[('emp_id', 2, None, None, None, None, 0, 49699, 63), ('status', 253, None, None, None, None, 0, 1, 255), ('empid_x_pi', 246, None, None, None, None, 0, 32897, 63), ('last_name_upper', 253, None, None, None, None, 1, 0, 255)]

In [53]:
cursor.execute(""" 
    SELECT emp_id,
        "ACTIVE" AS status,
        emp_id * 3.14 AS empid_x_pi,
        UPPER(lname) AS last_name_upper
        FROM employee            
""")
columns = cursor.description
print(columns)

[('emp_id', 2, None, None, None, None, 0, 49699, 63), ('status', 253, None, None, None, None, 0, 1, 255), ('empid_x_pi', 246, None, None, None, None, 0, 32897, 63), ('last_name_upper', 253, None, None, None, None, 1, 0, 255)]

- Rmove duplicate using distinct

In [86]:
cursor.execute(""" 
    SELECT DISTINCT cust_id
        FROM account            
""")
columns = cursor.description
print(columns)

[('cust_id', 3, None, None, None, None, 0, 53289, 63)]

- From clause could include different tables:

1-permanent table

2- temporary table created by subquerries

3- virtual tables created by views

4- linked tables by join

In [90]:
## subquerry
cursor.execute(""" 
    SELECT e.emp_id, e.fname, e.lname
    FROM (SELECT emp_id, fname, lname, start_date, title
          FROM employee) e            
""")
columns = cursor.description
print(columns)

[('emp_id', 2, None, None, None, None, 0, 49699, 63), ('fname', 253, None, None, None, None, 0, 4097, 255), ('lname', 253, None, None, None, None, 0, 4097, 255)]

In [95]:
## virtual tables 
### first create a view
cursor.execute(""" 
    CREATE VIEW employee_vw AS
    SELECT emp_id, fname, lname, YEAR(start_date) start_year
    FROM employee
""")

## quesry from view
cursor.execute(""" 
    SELECT emp_id, start_year
    FROM employee_vw
""")

columns = cursor.description
print(columns)

[('emp_id', 2, None, None, None, None, 0, 49699, 63), ('start_year', 8, None, None, None, None, 1, 32896, 63)]

In [99]:
## table links--> to reference tables we can use whole name or alias

cursor.execute(""" 
    SELECT employee.emp_id, employee.fname, employee.lname, department.name dept_name
    FROM employee INNER JOIN department
    ON employee.dept_id = department.dept_id
""")

columns = cursor.description
print(columns)

[('emp_id', 2, None, None, None, None, 0, 49699, 63), ('fname', 253, None, None, None, None, 0, 4097, 255), ('lname', 253, None, None, None, None, 0, 4097, 255), ('dept_name', 253, None, None, None, None, 0, 4097, 255)]